#### BuiltInFailures.SteelElementsFailures Members

---

|  |
| --- |
| BuiltInFailures SteelElementsFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SteelElementsFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | SteelElementInvisibleInCurrentLevelOfDetailWarn | The created elements are only visible in Detail Level: Fine. |
| Public property Static member | SteelElementModifiersWillBeIgnoredWarn | The copes and cuts (by face, with voids, by reference plane) of the element are no longer modifying the geometry. |

# See Also

BuiltInFailures SteelElementsFailures Class

Autodesk.Revit.DB Namespace